# [7기 멤버 코딩테스트]

<font color="#CC3D3D"><p>
## 문제 1( 10점)
### 중간고사, 기말고사, 과제 점수를 모두 합한 10명의 학생의 점수를 구하는 코드를 zip을 이용하여 작성하여 리스트에 넣고, 점수가 높은 순서대로 정렬하시오.

<font color="#CC3D3D"><p>
- 리스트 순서대로 1명의 학생입니다 
- 예) 첫번째 학생 34+45+5 = 84

    아래 코드를 실행시키고문제에 답하시오.

In [2]:
중간고사 = [34, 30, 26, 40, 33, 15, 31, 21, 17, 40]
기말고사 = [45, 48, 25, 50, 50, 28, 39, 33, 47, 42]
과제 = [5, 10, 8, 10, 10, 7, 7, 9, 10, 2]

 <답안 예시>
 
 [100, 97, 95, 93, 91, 89, 87, 85, 83, 81]

In [14]:
a= [x + y + z for x, y, z in zip(중간고사, 기말고사, 과제)]
a.sort(reverse=True)
a

[100, 93, 88, 84, 84, 77, 74, 63, 59, 50]

<font color="#CC3D3D"><p>
## 문제 2 (20점)
### 비타민에서는 동아리 지원시 개별 지원번호가 부여된다.
### 지원번호를 입력하면 성별, 기수, 편입여부, 운영진여부 를 출력하는 프로그램을 작성하시오.
    
- 지원번호는 앞에서 부터 순서대로 합격시 활동시작연도 -활동시작학기(1학기,2학기)- 성별(1- 편입아니고 남자,2- 편입아니고 여자, 3-편입이고 남자, 4-편입이고 여자)-임의 부여번호2자리 - 운영진 여부(운영진이면 s)
   
- 비타민은 18년도 1학기부터 시작되었다. (1기)

- 예) 21-1-1-37-s 1학기 남자 (-는 이해를 돕기위해 추가한 예시)

    <답안 예시>
```python
>>> 지원번호를 입력하시오 : 211137s
성별: 남
기수:  7
편입: x 
운영진: o   
```
```python
>>> 지원번호를 입력하시오 : 211356  
성별: 남
기수:  6
편입: o
운영진: x 
```
    
아래 코드를 활용하여 작성하시오.

In [59]:
sn = input('지원번호를 입력하세요: ')

지원번호를 입력하세요: 211356s

In [56]:
str(sn[5])

'6'

In [60]:
if sn[3]==1 or 3:
    print('성별: 남')
else:
    print('성별: 여')

기수 = (int(sn[:2])-18 ) * 2 + int(sn[2])
print('기수:', 기수)
    
if sn[3] == 1 or 2:
    print('편입: x')
else:
    print('편입: o')

if len(sn) == 6:
    print('운영진: x')
elif str(sn[6]) == 's':
    print('운영진: o')

성별: 남
기수: 7
편입: x
운영진: o

<font color="#CC3D3D"><p>
## 문제3 pandas를 활용해 각 문항에 따라 답하시오.

<font color="#CC3D3D"><p>
아래 코드를 실행시키고문제에 답하시오.

In [15]:
import pandas as pd # 패키지는 모두 설치되어 있다고 가정
import numpy as np

<font color="#CC3D3D"><p>
## 3-1 (5점)
titanic.csv를 불러와 titanic에 저장하시오.

In [23]:
titanic = pd.read_csv("titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<font color="#CC3D3D"><p>
## 3-2 (10점)
titanic에서 Pclass, Age, Fare 열을 index 0부터 100까지 뽑아 df에 저장하시오.

(loc ,iloc 둘 중 적어도 하나 사용)

In [69]:
df = titanic.loc[:100,['Pclass', 'Age', 'Fare']]
print(df)

     Pclass   Age     Fare
0         3  22.0   7.2500
1         1  38.0  71.2833
2         3  26.0   7.9250
3         1  35.0  53.1000
4         3  35.0   8.0500
..      ...   ...      ...
96        1  71.0  34.6542
97        1  23.0  63.3583
98        2  34.0  23.0000
99        2  34.0  26.0000
100       3  28.0   7.8958

[101 rows x 3 columns]

<font color="#CC3D3D"><p>
## 3-3 (5점)
df에서 pclass 열을 버리고 버려졌는지 df를 불러서 확인하시오.

In [36]:
df = df.drop(['Pclass'], axis=1)
df

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
96   71.0  34.6542
97   23.0  63.3583
98   34.0  23.0000
99   34.0  26.0000
100  28.0   7.8958

[101 rows x 2 columns]

<font color="#CC3D3D"><p>
## 3-4 (5점)
df의 열별로 결측치가 몇개 존재하는지 확인하시오.

    < 답안 예시>
    Age     22
    Fare     0

In [37]:
df.isnull().sum()

Age     22
Fare     0
dtype: int64

<font color="#CC3D3D"><p>
## 3-5 (5점)
결측치가 있다면 그 다음 데이터로 채우시오.(index 숫자가 더 큰 = 다음)

In [61]:
df.fillna(method = 'bfill')

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
96   71.0  34.6542
97   23.0  63.3583
98   34.0  23.0000
99   34.0  26.0000
100  28.0   7.8958

[101 rows x 2 columns]

<font color="#CC3D3D"><p>
## 3-6 (10점)
df에서 Age가 40 이상인 행을 모두 뽑고 Age가 내림차순으로 정렬되도록 데이터프레임을 구성하시오.(데이터프레임에는 Age열과 Fare열이 모두 있어야함)

In [77]:
age = df['Age'] >= 40
df = df[age]
df.sort_values('Age', ascending=False)

    Pclass   Age     Fare
96       1  71.0  34.6542
33       2  66.0  10.5000
54       1  65.0  61.9792
94       3  59.0   7.2500
11       1  58.0  26.5500
15       2  55.0  16.0000
6        1  54.0  51.8625
52       1  49.0  76.7292
92       1  46.0  61.1750
62       1  45.0  83.4750
35       1  42.0  52.0000
30       1  40.0  27.7208
40       3  40.0   9.4750

<font color="#CC3D3D"><p>
##  3-7 (10점)
df.Fare를 평균이 0이고 분산이 1인 가우시안 정규분포를 가진 값으로 변환하려하는데 표준화하는 수식을 코드로 작성하고 lambda를 이용하여 df의 Fare 열을 표준화하시오.
    
(수식의 경우 구글링을 활용하시오.)

<font color="#CC3D3D"><p>
##  3-8 (20점)
titanic에서 Name에서 first name만을 뽑아 새로운 열인 First_Name을 titanic에 추가하시오.

참고 : johann + Sebastian + Bach
    
 (First name) +(Middle name) + (Surname)

<font color="#CC3D3D"><p>
# END

##  수고하셨습니다. 좋은 결과 있기를 바라며, 
## 코딩테스트는 절대적 평가기준이 아닙니다.